{
    "posts": [
        {
            "id": "1",
            "date": "2 April 2019",
            "title": "Black Clover Teases Yuno's new power.",
            "image": "https://media.comicbook.com/2019/04/spirit-dive-yuno-black-clover-anime-1165555.jpeg",
            "desc": "Black Clover is in the midst of the Royal Knights arc in the anime series, and thus is in the middle of a fierce tournament where many new powers and characters will be tested.The new opening theme has a few shots of Asta and Yuno powering up, but fans were quick to notice that the opening actually fully reveals Yuno's next big power up in the series. Read on to learn more about this mysterious power up, but there are major Black Clover manga spoilers below!..",
            "author": "Toyer"
        },
        {
            "id": "2",
            "date": "2 April 2019 ",
            "title": "'One Piece' Reveals Sanji's New Bounty",
            "image": "https://imgix.ranker.com/user_node_img/50081/1001612750/original/tears-of-a-women-and-_39_s-eyes-photo-u1?w=650&q=50&fm=pjpg&fit=crop&crop=faces",
            "desc": "Before the events of One Piece's Whole Cake Island arc revealed more about his past, Sanji's wanted poster was an interesting mystery. He had a bounty of 177 million belly, and could only be taken in alive when the rest of his crew was labeled as dead or alive..",
            "extra":"In Episode 878 of the series, Luffy and the Straw Hats get a newspaper that updates the world on Luffy's actions in the New World and have dubbed him as the Fifth Emperor of the Sea following the events of the Whole Cake Island arc. The newspaper also came with an updated wanted poster for Sanji, and he was all too happy to see his bounty rise to such an extent.With his bounty increased to 330 million, this puts him above Zoro's 320 million bounty. Though Sanji's celebration does not last long as he finds that he is now listed as Vinsmoke Sanji. He suggests that his bounty increased to such an extent due to the Germa 66's bad reputation, and he's not the only one unhappy with the updates either as Luffy seems to have gotten bad news as well. Though fans don't quite get to see what this is.",
            "author": "Nick Valdez"
        },
        {
            "id": "3",
            "date": "4 April 2019 ",
            "title": "'Dragon Ball Super' Teases That Moro Is More Powerful Than the Gods",
            "image": "/images/moro.jpeg",
            "desc": "Dragon Ball Super's latest manga chapters have been revealing just how brutal, sadistic, and powerful new franchise villain Moro really is. The evil ancient sorcerer has come to New Namek looking to slaughter anyone necessary to obtain the Namekian Dragon Balls, with only Goku and Vegeta standing in his way -- or at least, trying to stand in his way..",
            "extra": "Moro proves to have what are essentially Super Saiyan-Killer powers; his Planet-Eating powers allow him to drain Super Saiyan energies and add them to his own while his magic allows him to turn a planet's very core into a destructive inferno that Moro controls at this whim. However, it's when Moro sucks the very life force from Goku and Vegeta's bodies that it really becomes clear how lethal of a predator he is!",
            "author": "Kofi Outlaw"
        }
    ]
}